package com.vaka.epam.homework.week4.task27;

/**
 * Created by Iaroslav on 11/19/2016.
 */
//27. Вариант в этой задаче выбирать согласно правилу (номер_студента_в_списке % 15). Выполнить только один вариант
//В каждом из предложенных вариантов требуется при помощи  Rational Rose построить модель программного обеспечения.
//        При проектировании системы требуется:
//        - создать иерархию классов системы;
//        - построить диаграммы классов системы, отображающие связи между классами;
    //

//15.	Интернет-магазин
//        Требуется разработать средствами Rational Rose модель программного обеспечения Интернет-магазина.
//        Интернет-магазин позволяет делать покупки с доставкой на дом.
//        Клиенты магазина при помощи программы-браузера имеют доступ
//        к каталогу продаваемых товаров, поддержку которого осуществляет
//        Интернет-магазин. В каталоге товары распределены по разделам.
//        О каждом товаре доступна полная информация (название, вес, цена,
//        изображение,  дата изготовления и срок годности) Для удобства клиентов
//        предусмотрена система поиска товаров в каталоге. Заполнение каталога
//        информацией происходит автоматически в начале рабочего дня,
//        информация берется из системы автоматизации торговли.
//        При отборе клиентами товаров поддерживается виртуальная
//        «торговая корзина». Любое наименование товара может быть добавлено
//        в «корзину» или изъято в любой момент по желанию покупателя с последующим
//        пересчетом общей стоимости покупки. Текущее содержимое «корзины» постоянно показывается клиенту.
//        По окончании выбора товаров производится оформление заказа и регистрация покупателя.
//        Клиент указывает в регистрационной форме свою фамилию, имя и отчество,
//        адрес доставки заказа и телефон, по которому с ним можно связаться
//        для подтверждения сделанного заказа. Заказы передаются для обработки
//        в систему автоматизации торговли. Проверка наличия товаров на складе
//        и их резервирование Интернет-магазином не производятся.


public class RationalRose {
}
