package com.vaka.epam.homework.week4.task24;

/**
 * Created by Iaroslav on 11/19/2016.
 */
//24. Паттерн Chain of responsibility. Прохождение платежа через банковскую си-
//        стему сопровождается целым рядом действий: фиксирующих, контролиру -
//        ющих, снимающих процент банка и прочие вычеты и действия. Построить
//        цепочки для различного вида платежей (обычных, льготных, государствен -
//        ных, внутрибанковских) в соответствии с предметной областью и разрабо-
//        тать модель системы.
public class ChainOfResponsibility {
}
